0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include	"data";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($Ux $Uy 0);

boundaryField
{
    airfoil
    {
    	type            noSlip;
    }
    
    outlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }
    inlet
    {
        type            freestreamVelocity;
        freestreamValue $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
