0/data
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

U       14.607;                 // Inlet Velocity
AoA     5;                      // Angle Of Attack
I       0.01;                   // Turbulence Intensity
C       1.00;                   // Airfoil Chord

PI      3.14; 
    
Ux      #calc"$U * cos($AoA * $PI / 180)";  // X-Velocity Component
Uy      #calc"$U * sin($AoA * $PI / 180)";  // Y-Velocity Component

Lx      #calc"-sin($AoA * $PI / 180)";
Ly      #calc" cos($AoA * $PI / 180)";
Dx      #calc" cos($AoA * $PI / 180)";
Dy      #calc" sin($AoA * $PI / 180)";