constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          133;
        startFace       27485;
    }
    outlet
    {
        type            patch;
        nFaces          96;
        startFace       27618;
    }
    inlet
    {
        type            patch;
        nFaces          289;
        startFace       27714;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          27744;
        startFace       28003;
    }
)

// ************************************************************************* //
