system/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
yPlus1
    {
        type        yPlus;
        libs        ("libfieldFunctionObjects.so");

        writePrecision  5;
        writeToFile     true;
        useUserTime     true;

        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         2000;

        writeFields     yes;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   1;

    }

// ************************************************************************* //
